In [2]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [4]:
ser1 = Series(np.arange(3),index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int64

In [9]:
ser1.drop('b')

a    0
c    2
dtype: int64

In [11]:
dframe1 = DataFrame(np.arange(9).reshape((3,3)),index=['SF','LA','NY'],columns=['pop','siz','year'])
dframe1

    pop  siz  year
SF    0    1     2
LA    3    4     5
NY    6    7     8

In [14]:
dframe1.drop('LA') #the arugment passed by default means an index value i.e. 'LA', you could also specify axis=0 meaning rows

    pop  siz  year
SF    0    1     2
NY    6    7     8

In [17]:
dframe1

    pop  siz  year
SF    0    1     2
LA    3    4     5
NY    6    7     8

In [18]:
dframe1.drop('year',axis=1) #axis=1 means columns, axis=0 which is the default means rows

    pop  siz
SF    0    1
LA    3    4
NY    6    7